[
  "I'm not even doomscrolling anymore. I'm regular scrolling and everything is doomed.",
  "My son found me crying in the kitchen, wrapped his arms around me an whispered 'is it because you're fat?' Now I'm crying for two reasons.",
  "Oh him? He's my insignificant other",
  "Kinda a scam that my ex got to know what being loved was like and I didn't.",
  "Mail is crazy because it's like 99 pieces of actual trash and then 1 that if you don't respond you're going to prison.",
  "Don't know why but there's something almost intoxicating about drinken 14 beers",
  "Hate this new google docs 'ask gemini' feature. If I wanted to get misinformation from a gemini I'd talk to my mother.",
  "The moon is actually more useful than the sun, since the moon gives us light at night, when it's dark. The only gives us light in the day when it's already bright.",
  "For a guy supposedly called my 'brother' I've never seen him make broth even once.", "I don't understand why people say 'you can't have your cake and eat it too'. Of course you can, that's what it's for.", "I don't understand why people say 'you can't have your cake and eat it too'. Of course you can, that's what it's for.",
  "gf says because we got Chinese yesterday we can't get it today. I don't think that makes sense. They do it in China all the time.",
  [
    "friend: I really just hate dogs",
    "me:but I thought him a lot of tricks",
    "friend: dogs are stupid what could u have possibly taught-",
    "*my dog jumps up and kicks him in the face*",
    "me: karate"
  ],
  [
    "[after date]",
    "her: let's go back to my place and watch a movie",
    "[at her place]",
    "her waiting for me to make a move;",
    "me: *pointing* that rat is actually really good at cooking just wait"
  ],
  [
    "[taking date back to my room]",
    "me: are u thinking what i'm thinking",
    "her: *bites lip* yeah",
    "[both of us at the same time]",
    "her: take off my bra-",
    "me: we should build a fort"
  ],
  [
    "moses: *parts the red sea*",
    "fish: ok wtf",
    "[later]",
    "fish's boss: why were u late",
    "fish: ur not gonna believe this"
  ],
  [
    "interviewer: what did you bring to the table",
    "me: in my last job i brought a lot of enthusia-",
    "interviewer: no what did you just put on my desk",
    "me: u mean my toad"
  ],
  [
    "her: my hips don't lie",
    "me: nice lol",
    "her hips: you will never find a girlfriend",
    "me: wait no"
  ],
  [
    "witch: *turns me into a frog* now SUFFER",
    "me: *chilling on a leaf*",
    "witch: wait",
    "me: *experiencing happiness for the first time in my life*",
    "witch: wait no"
  ],
  [
    "king: you're going to the dungeon, guards take him away",
    "*the guards start breakdancing*",
    "king: no guys I said take him away not take it away"
  ],
  [
    "doctor: your wife is going to dye-",
    "me: oh my god",
    "doctor: her hair",
    "me: oh haha i thought u meant-",
    "doctor: for her funeral"
  ],
  [
    "Applebee's waiter: what would u like to order",
    "me: I'll have the apple",
    "waiter: we don't actually sell apples",
    "me, visibly afraid: ok then [gulps] I'll have the bees"
  ],
  [
    "*I get down on one knee*",
    "me: will u marry me",
    "her: where's the ring",
    "me: oh oops lol [reaching in my pocket and pulling out an entire handful of spaghetti] ok wrong pocket wait"
  ],
  [
    "girlfriend: he's too immature i'm dumping him",
    "her friend: ya remember when he got excited that he could drink 2 capri suns at once?",
    "[I walk in holding 3 capri suns] babe you're note gonna believe this"
  ],
  ["I like getting cute morning texts like \"Your other has been shipped.\""],
  [
    "I go to work, I make my coworkers wonder what's wrong with me, I go home, I make my family wonder what's wrong with me, and then I go to bed wondering what's wrong with me."
  ],
  [
    "My level of sarcasm has gotten to a point where I don't even know if I'm joking or not."
  ],
  ["I think it's extremely important, especially in the morning, to be quiet"],
  ["Men have nice skin because they stress out everyone but themselves."],
  ["\"Do you prefer texting or calling?\"", "I like \"Do not disturb\" mode."],
  [
    "Everytime the universe gives me a sign, I'm like ok but I wait for a signier sign."
  ],
  ["\"Your bill is ready to view\"", "Well ok but I'm not ready to view it."],
  [
    "I'm looking for a man with one eye.",
    "You'd find him quicker if you used both eyes."
  ],
  [
    "I realised I've got a road rage problem when my five-year-old daughter shouted...",
    "\"Pick a lane, dickhead!\" while sitting in my shopping trolley."
  ],
  ["Well, to be frank...", "I'd have to change my name"],
  [
    "I went into a pet shop and said \"Can I buy a goldfish?\"",
    "The guy said, \"Do you want an aquarium?\"",
    "I said, \"I don't care what star sign it is.\""
  ],
  ["\"Do not touch\" must be one of the scariest things to read in braille."],
  [
    "If you ever think English is not a weird language just remember that read and lead rhyme and read and lead rhyme. But read and lead don't rhyme, and neither do read and lead."
  ],
  ["People are usually shocked when they find out I’m not a good electrician."],
  [
    "Amal and Juan are identical twins. Their mom only carries one baby photo in her wallet.",
    "When people ask why, she says, \"Because if you've seen one Juan, you've seen Amal.\""
  ],
  ["To the guy who invented zero. Thanks for nothing."],
  [
    "I was upset when my neighbor put a fence around his swimming pool. But then I got over it."
  ],
  [
    "I wonder what my parents did to fight boredom before the internet?",
    "I asked my 18 brothers and sisters and they don't know either."
  ],
  ["I ordered a chicken and an egg on Amazon. I’ll let you know."],
  ["People are usually shocked when they find out I’m not a good electrician."],
  ["I ordered a chicken and an egg on Amazon. I’ll let you know."],
  ["My new stair lift is just driving me up the wall."],
  ["My friend was explaining electricity and I was like watt?"],
  ["If you hate speeding tickets raise your right foot."],
  ["I shot a man with a paintball gun just to watch him dye."],
  ["The love triangle soon turned into a wrecktangle."],
  ["Insect puns really bug me."],
  ["Do memory foam mattresses wish they could forget?"],
  ["I got my wife a new fridge. Her face lit up when she opened it!"],
  ["Before the Crowbar was invented crows had to drink at home."],
  ["The 3 Symptoms of Laziness:"],
  ["I sued the airline for losing my luggage. I Lost my case."],
  ["I used to be a lifeguard until some blue kid got me fired."],
  ["Technically, national anthems are just country music."],
  ["My new stair lift is just driving me up the wall."],
  ["Never trust a train. They have loco motives."],
  ["The little mermaid wears an algebra to math class."],
  ["Procrastinators Anonymous Meeting postponed indefinitely."],
  ["Restaurant opens on the Moon! Great food! No atmosphere."],
  ["Stop killing buffalo for their wings!"],
  ["Disbarred lawyer finds new work as sue chef"],
  ["I have a chicken-proof lawn. It’s impeccable."],
  ["Texting and driving is not wreckommended."],
  ["I’m pining for a good tree pun. I wish they were more poplar."],
  ["I drank some food colouring and dyed a little inside."],
  ["It was me. I let the dogs out."],
  ["Never play leapfrog with a unicorn."],
  ["Ducks have feathers to cover their butt quacks."],
  ["Norwegian ships have bar codes so you can scan da navy in."],
  ["I have an Elton John pun. It’s a little bit funny."],
  ["My friend David had his ID stolen. Now he’s just Dav."],
  ["I looked up opaque. The definition wasn't very clear."],
  ["My wife got a job at the zoo. She’s a keeper!"],
  [
    "I have a fear of over-engineered buildings. It’s a complex complex complex."
  ],
  ["C-sections are for pussies."],
  [
    "I’m reading a horror book in Braille.",
    "Something terrible’s about to happen.",
    "I can feel it."
  ],
  [
    "Two years ago my doctor told me I was going deaf.",
    "I haven't heard from him since."
  ],
  ["I tripped over my wife’s bra. It was a booby trap."],
  [
    "I always knock on the fridge before I open it. Just in case there’s a salad dressing."
  ],
  [
    "A sweater I bought was picking up static electricity, so I returned it to the store. They gave me another one free of charge."
  ],
  [
    "My girlfriend broke up with me because I’m a compulsive gambler...",
    "Ever since, all I can think of is how to win her back."
  ],
  ["My son asked me what procrastinate means. I said 'I’ll tell you later'."],
  [
    "I trapped a couple of vegan burglars in my basement. ",
    "At least I think they’re vegan.",
    "They kept shouting 'lettuce leaf'."
  ],
  [
    "I just saw a real idiot at the gym.",
    "He put a water bottle in the Pringles holder on the treadmill."
  ],
  ["Stephen King has a son named Joe.", "I’m not joking, but he is."],
  ["I want to be cremated as it is my last hope for a smoking hot body."],
  [
    "I got some shoes from my drug dealer recently.",
    "I don't know what he laced them with, but I’ve been tripping all day."
  ],
  ["Shout out to the people that don't know what the opposite of in is!"],
  [
    "A crazy wife says to her husband that moose are falling from the sky.",
    "The husband says, it’s reindeer."
  ],
  [
    "So what if I don't know what apocalypse means?",
    "It’s not the end of the world!"
  ],
  ["Thanks for explaining the word 'many' to me, it means a lot."],
  [
    "I had a crazy dream last night.",
    "I was swimming in an ocean of orange soda.",
    "Turns out it was just a Fanta sea."
  ],
  ["I’m close friends with 25 letters of the alphabet, I don't know y..."],
  ["I saw a sign that said falling rocks, so I tried and it doesn't."],
  ["My grandpa has the heart of the lion and a lifetime ban from the zoo."],
  ["I lost my mood ring and I don't know how to feel about it."],
  ["Einstein developed a theory about space, and it was about time too."],
  ["Time flies like an arrow. Fruit flies like a banana."],
  ["I don't trust stairs because they’re always up to something."],
  [
    "Rick Astley will let you borrow any of his Pixar collection DVDs but he will never give you Up."
  ],
  ["How much does a hipster weigh? an Instagram."],
  [
    "As I get older and remember all the people I lost along the way,",
    "I think to myself... Maybe a career as a tourist guide was not the right choice."
  ],
  [
    "To the man in the wheelchair who stole my camo jacket: you can hide, but you can't run."
  ],
  ["Some aquatic mammals at the zoo escaped.", "It was otter chaos."],
  ["I used to be a tap dancer until I fell in the sink."],
  [
    "My girlfriend likes to tie me to the bed and cover me in chocolate and caramel.",
    "She’s a dominatwix."
  ],
  [
    "He couldn't work out how to fix the washing machine so he threw in the towel."
  ],
  ["It took a while to learn to use a hammer but we finally nailed it."],
  [
    "Astronomers got tired of watching the moon rotate around the earth for 24hrs.",
    "So they just called it a day."
  ],
  ["I have many jokes about unemployed people.", "Sadly none of them work."],
  ["Say what you want about deaf people."],
  [
    "A Mexican magician told his audience he was going to vanish on the count of three.",
    "He counted, 'Uno, dos...' and disappeared without a tres."
  ],
  ["A man walked into a zoo.", "There was one dog.", "It was a Shih Tzu."],
  [
    "Why'd the old man fall down the well?",
    "Because he couldn't see that well."
  ],
  [
    "Yesterday, I was washing the car with my son.",
    "He said 'dad, can't you just use a sponge?'"
  ],
  ["I wrote a song about a tortilla.", "Actually it’s more of a wrap."],
  [
    "My boss hates it when I shorten his name to Dick.",
    "Especially when his name is Steve."
  ],
  ["The person who invented autocorrect should burn in hello."],
  ["Just read a book about the history of glue.", "Couldn't put it down."],
  [
    "'And for my next trick I will dissapear: Fuck you pear, you taste like shit'"
  ],
  [
    "I recently found a round, black piece of plastic, with a hole in the middle and grooves on both sides.",
    "I picked it up and threw it. It flew for more than 300 yards.",
    "I’m sure that must be a record."
  ],
  [
    "I went to my doctor today and told him I was having problems with my hearing.",
    "He asked, 'Can you describe the symptoms?' I replied, 'Sure...'",
    "'They’re yellow, Homer’s fat and Marge has blue hair.'"
  ],
  ["'I have a split personality,' said Tom, being frank"],
  [
    "My ex girlfriend and I would have never worked out because I’m a gemini and she’s a bitch."
  ],
  [
    "My friend joined a cult.",
    "They believe that one day they will cease to exist in their human form, and become water vapour.",
    "I told him, 'you will be mist'."
  ],
  [
    "People are usually shocked when they find out I am not a good electrician."
  ],
  [
    "Just had a message from a random guy asking to meet in the woods to compare dick sizes.",
    "Fucking weirdo didn't even turn up."
  ],
  ["Did I already do my deja-vu joke?"],
  ["I like what mechanics wear. Overall."],
  [
    "I quit my job in the helium factory.",
    "I refused to be spoken to in that tone."
  ],
  ["I’m lazy. I’m so lazy I....."],
  ["I want to write a mystery Novell. Or do I...."],
  ["I accidentally filled the escort with diesel.", "She died."],
  ["I bought an alcoholic ginger beer.", "She didn't like it."],
  ["My computer beat me at chess.", "But then I beat him at kickboxing."],
  ["I farted in a full lift today, which is wrong on so many levels."],
  [
    "I was horrible in school.",
    "I failed math so many times I can't even count."
  ],
  ["I believe bad spellers should form an onion."],
  ["I think women who believe size doesn't matter are shallow."],
  [
    "We have a beautiful little girl who we named after my mom.",
    "Fat Passive-Aggressive Psycho turns five tomorrow."
  ],
  [
    "I always worry when a woman sees me naked for the first time, that she’s gonna scream and run out of the park."
  ],
  [
    "Letting go of a loved one can be hard.",
    "But sometimes it’s the only way to survive a rock climbing catastrophe."
  ],
  ["A good book is like a puppy.", "Easy to pick up but hard to put down."],
  [
    "I once caught myself in a cycle of masturbation when I found out about my fetish for wrist pain."
  ],
  ["Whenever I think about the past it just brings back so many memories."],
  [
    "There’s a fine line between phishing and just standing on the shore like an idiot."
  ],
  ["I can levitate birds but nobody cares."],
  ["I took a lie detector test.", "No I didn't."],
  [
    "I told my girlfriend I was going out for a walk.",
    "She said how long will you be gone? I said the whole time."
  ],
  ["I saw a poster that said 'lost 50 dollars, if found just keep it'"],
  [
    "Sponges grow in the ocean.",
    "I’d like to know how much deeper the ocean would be if that didn't happen."
  ],
  [
    "My friend couldn't afford to pay his water bill.",
    "So I sent him a 'get well soon' card."
  ],
  ["My wife said \"nothing rhymes with orange\", I said \"no it doesn't\"."],
  [
    "My daughter told me nothing rhymes with orange.",
    "I told her she’s wrong."
  ],
  ["Just sold my homing pigeon on eBay for the 22nd time."],
  ["Having a dog named 'Shark' at the beach was a bad idea."],
  ["Procrastination is the art of keeping up with yesterday."],
  ["87% of gym members don't know it’s closed."],
  ["I child-proofed my house but the kids still get in."],
  ["There’s no way that everybody was kung-fu fighting."],
  ["Went to the air and space museum but there was nothing there."],
  ["The first 5 days after the weekend are the hardest."],
  ["I call my horse Mayo and sometimes Mayo neighs."],
  ["Dogs can't operate MRI scanners but cat’s can."],
  ["All those who believe in psychokinesis raise my hand."],
  ["What if soy milk is just regular milk introducing itself in Spanish?"],
  [
    "I dated a girl who was a twin. People asked how I told them apart.",
    "It’s simple Mary paints her nails pink and Mike has a dick."
  ],
  ["Maybe broccoli doesn't like you either."],
  ["Feeling a bit paranoid? Remember… you are not alone."],
  ["I hate peer pressure! And so should you."],
  ["A cardiology video is totally clips of the heart."],
  ["I just can't handle automatic doors."],
  ["Oxygen and magnesium are dating. OMg!"],
  ["Be careful when you eat at Sam & Ella’s diner."],
  ["If you stand by the sea it sounds like putting a shell to your ear."],
  ["Water is heavier than butane because butane is a lighter fluid."],
  ["Welcome to assumption club! I think we all know why we’re here."],
  ["Somebody’s therapist knows all about you."],
  ["To the thief who took my anti-depressants: I hope you’re happy."],
  ["A bike in town keeps running me over.", "It’s a vicious cycle."],
  ["The cashiers around here are always checking me out."],
  ["Those who insert animal names in words are hippocrites."],
  ["I never finish anything.", "I have a black belt in partial arts."],
  [
    "My wife wants me to blow air on her whenever she overheats.",
    "But honestly, I’m not a fan."
  ],
  [
    "The institute for unfinished research has conclude that 6 out of 10 people"
  ],
  [
    "A hole was found in a nudist camp wall and the police are now looking into it."
  ],
  ["I hate when people exaggerate. I hear it a million times a day."],
  ["The dyslexic devil worshipper sold his soul to Santa."],
  [
    "As I handed my Dad his 50th birthday card, he looked at me with tears in his eyes and said, 'You know, one would have been enough.'"
  ],
  [
    "I was on a diabetes awareness website and it asked me if I accept cookies... Is this a trick question?"
  ],
  [
    "My wife dated a clown before she started going out with me.",
    "I had some pretty big shoes to fill."
  ],
  [
    "I asked my wife if I am the only one she has ever been with.",
    "She said yes, all the others were nines and tens."
  ],
  [
    "I was reading a great book about an immortal cat the other day.",
    "It was impossible to put down."
  ],
  ["If a Viking is reincarnated, Is he Bjorn again?"],
  [
    "My wife told me: Sex is better on holiday.",
    "I wasn't expecting that on the postcard she sent from Greece."
  ],
  [
    "My wife and I always fight over the right way to hang the toilet paper roll",
    "So our therapist suggested we try the other person's way for a week. You know. Roll reversal."
  ],
  [
    "What’s the most effective way to remember your wife’s birthday?",
    "Forget it once."
  ],
  [
    "The Earth's surface is 70% water. ",
    "That water is uncarbonated.",
    "Therefore, the Earth is flat."
  ],
  [
    "I am trying to convince my dad to get a new hearing aid.",
    "But he just won't listen."
  ],
  [
    "I was sitting on the toilet, angry, and late for work.",
    "I thought, \"I don't have time for this shit.\""
  ],
  [
    "My email password got hacked again.",
    "That's the third time I've had to rename the cat."
  ],
  [
    "As I put my car in reverse, I thought to myself...",
    "'This takes me back.”"
  ],
  ["I’m not a competitive person... ", "I’ll be the first to admit it."],
  ["If you rearrange the letters of MAILMEN they get really upset."],
  [
    "Can someone please tell me what the lowest rank in the army is? ",
    "Every time I ask someone, they tell me \"it's private\"."
  ],
  [
    "I quit my job after my boss started paying me in vegetables.",
    "I could not live off that celery."
  ],
  [
    "I haven't sold a single copy of my autobiography.",
    "That's the story of my life."
  ],
  [
    "I asked my wife when her birthday was.",
    "She said March 1st.",
    "So I walked around the house and asked again."
  ],
  ["I go to the toilet for two reasons.", "Number one and number two."],
  [
    "I walked down the street dressed as a screwdriver.",
    "I turned a few heads."
  ],
  [
    "There's a reason  why Daniel Craig has greying hair in the latest Bond movie.",
    "He had no time to dye."
  ],
  [
    "When I get into work I immediately hide.",
    "Good employees are hard to find."
  ],
  ["My wife says I'm cheap.", "But I'm not buying it."],
  ["Tequila may not be the answer.", "But it's definitely worth a shot."],
  ["An armed man ran into a real estate agency and shouted: \"Nobody move!\""],
  [
    "I'd like to have kids one day... ",
    "I don't think I could stand them any longer than that though."
  ],
  ["I told my son he shouldn't listen to losers.", "Now he won't talk to me."],
  [
    "I wrote a book on how to fall down the stairs.",
    "It’s a step by step guide."
  ],
  [
    "The Egyptians claim there are no crocodiles in their country.",
    "I think they're in de Nile."
  ],
  [
    "Did you hear about the pole vault champion of North Korea?",
    "He’s now the pole vault champion of South Korea."
  ],
  [
    "To everyone out there suffering from paranoia.",
    "Just remember you’re not alone."
  ],
  [
    "I went to a bookstore and saw a book titled \"How to solve 50% of your problems\". I bought 2."
  ],
  ["My friend decided to become an archeologist", "Now his life is in ruins."],
  [
    "I told my girlfriend I think she's cheating on me.",
    "She told me I sound just like her husband."
  ],
  ["Never share a secret with a clock.", "Time will tell."],
  [
    "I was out with my young daughter and ran into a friend I'd not seen in years.",
    "\"This is Beth.\" I said, introducing my kid.",
    "\"And what's Beth short for?\" he asked.",
    "\"Because she’s only three,” I replied."
  ],
  [
    "Karl Marx is a historically famous philosopher but no-one ever mentions his sister, Onya, the inventor of the starting pistol."
  ],
  ["Somebody said my dad's gay.", "And I’m now trying to work out which one."],
  [
    "I invented a car that only moves when you're silent.",
    "It really goes without saying."
  ],
  [
    "I was abducted by aliens.",
    "They made me wash my hands, clean my room, and eat my vegetables.",
    "Turns out I was on the mothership."
  ],
  [
    "I never thought orthopaedic shoes really would work for me.",
    "But I stand corrected."
  ],
  [
    "I have a feeling that I’ll be fired from my job at the graffiti removal company.",
    "The writing is on the wall."
  ],
  ["My wallet is like an onion.", "When I open it, it makes me cry."],
  ["I used to be addicted to time travel.", "But that’s all in the past now."],
  ["It takes guts to be an organ donor."],
  ["I’m not wearing glasses anymore.", "I’ve seen enough."],
  ["My horse has insomnia and keeps everyone awake.", "She’s a nightmare."],
  [
    "I bought a dog off a blacksmith today and as soon as I got home, it made a bolt for the door."
  ],
  ["I am so poor. I can't even pay attention."],
  ["Can anyone tell me what oblivious means?", "I have no idea."],
  [
    "I told my wife she needs to start embracing her mistakes.",
    "So she hugged me."
  ],
  [
    "I was shocked the other day when I thought I heard my girlfriend say she wanted to go to see The Monkees tribute band in Switzerland.",
    "Then I saw her face - now I’m in Geneva."
  ],
  [
    "85% of people don’t know how to do basic math.",
    "Thank God I’m part of the other 25%."
  ],
  ["When I was kid my social network was called “outside”."],
  ["Don’t use double negatives", ". They’re a big no no."],
  ["My niece calls me Ankle.", "I call her my Knees."],
  [
    "I saw my first porn film last week.",
    "I couldn’t believe how young I looked."
  ],
  [
    "Gravity is one of the most fundamental forces in the universe, but if you remove it, you get gravy."
  ],
  ["I taught my pet wolf how to meditate...", "Now he's aware wolf."],
  [
    "I had a game of quiet tennis today.",
    "It’s just like regular tennis but without the racket."
  ],
  ["Tequila may not fix your life.", "But it’s worth a shot."],
  [
    "A fortune-teller told me that in 10-15 years, I would suffer the most terrible heartbreak any man has ever faced. ",
    "I was so upset over learning this.",
    "I decided to cheer myself up -- I adopted a puppy, and I've never been happier!"
  ],
  ["I saw a microbiologist today.", "He was much bigger than I expected."],
  [
    "I am the worst speller.",
    "You mix up two letters and your whole post is urined."
  ],
  ["My wife asked if I’d seen the dog bowl.", "I said I never knew he did."],
  [
    "Don't break peoples hearts! ",
    "They only have one.",
    "Break their bones.",
    "They have 206."
  ],
  [
    "I used to be a bus driver but I had to quit.",
    "I was fed up of people talking behind my back."
  ],
  [
    "A genie granted me one wish - so I wished to be happy. ",
    "Now I live with 6 dwarves and work in a mine."
  ],
  [
    "I had a happy childhood. ",
    "My dad used to put me in tires and roll me down hills. Those were Goodyears."
  ],
  [
    "I was once attacked by a whole bunch of mimes.",
    "They did some unspeakable things to me."
  ],
  ["My 3 favourite things are eating my family and not using commas."],
  [
    "My teacher always said not to worry about proper spelling, because we have autocorrect.",
    "And for this I am infernally grapefruit!"
  ],
  [
    "Did you hear that the inventor of autocorrect died?",
    "May he rust in place."
  ],
  ["I lost my mood ring and I don't know how I feel about it!"],
  [
    "Just heard someone turn down after-work plans because they have an avocado at home that's about to go bad."
  ],
  ["There is no \"we\" in Chocolate."],
  ["Don't tell secrets to your clock, because time will tell."],
  ["I didn't mean to push all of your buttons, I was just trying to hit mute."],
  ["If anyone wants a copy of \"Orthopedics Today\", I have back issues."],
  ["Age is not a number.", "It's clearly a word."],
  ["The coolest guy at the hospital is the hip replacement doctor."],
  [
    "My wife thought my kids were spoiled, but I think most kids smell like that."
  ],
  [
    "Our salads were a bit on the dry side, it was a situation that needed addressing."
  ],
  ["I'm reading a book about sandpaper.", "It's a work of friction."],
  ["Last week's apathy group meeting has been cancelled."],
  ["My brother collects Beatles memorabilia.", "He needs Help."],
  [
    "A dog may be your best friend but he will never pick you up from the airport."
  ],
  ["According to the BMI chart in my doctor's office I'm too short."],
  [
    "I cleaned the attic with my wife but can't get the cobwebs out of her hair."
  ],
  ["Why is it called \"camouflage\" and not"],
  ["My half brother and I aren’t allowed to play with chainsaws anymore."],
  ["I just realized the word \"seven\" has \"even\" in it. ", "That's odd."],
  [
    "Having too much sex can cause memory loss.",
    "I read it on page 14 in a medical journal on the 14th of november 2019."
  ],
  ["If people make you sick, maybe you should cook them longer."],
  ["I went to the paint store to get thinner.", "I didn't work."],
  ["I have a black eye in karate."],
  ["I married my wife for her looks, but not the ones I'm getting lately."],
  [
    "I told my kid he had to study maths and he said 'what for? '",
    "I told him yeah, and all the other numbers too."
  ],
  [
    "My girlfriend says I’m afraid of commitment.",
    "Well, she’s not my girlfriend. She’s more my wife."
  ],
  [
    "I’m a one-line comedian. I’m not a storyteller. ",
    "Interesting how that all started..."
  ],
  [
    "My girlfriend’s dog died so I bought here an identical one. ",
    "She was livid. ",
    "'What am I going to do with two dead dogs?'"
  ],
  ["Knock knock", "Who’s there?", "Granddad", "Shit stop the funeral."],
  [
    "My wife told me I’ve grown as a person",
    "Her actual word were 'you’ve gotten fat', but I know what she meant."
  ],
  [
    "My doctor wrote me a prescription for daily sex.",
    "But my wife insists it's for dyslexia."
  ],
  [
    "My wife: You need to do more chores around the house.",
    "Me: Can we change the subject?",
    "My wife: Ok, more chores around the house need to be done by you."
  ],
  [
    "Went to the zoo this morning and found a baguette in a cage.",
    "Pretty sure it was bread in captivity."
  ],
  [
    "Her: I’m leaving. I am sick of you wearing a different t shirt every half an hour.",
    "Me: Wait. I can change."
  ],
  [
    "'Who are you, and how did you get in here?'",
    "'I’m a locksmith. And I’m a locksmith'"
  ],
  [
    "Boy : 'Dad, could you tell me what a solar eclipse is?'",
    "Dad : 'No sun'."
  ],
  ["What you call a deer in the shower ?", "A raindeer."],
  [
    "When I was in college, I was rejected from every fraternity because I was circumcised.",
    "Apparently, you need to be a complete dick."
  ],
  ["I accidentally filled the escort with diesel. She died."],
  [
    "I always worry when a woman sees me naked for the first time, that she’s gonna scream and run out of the park."
  ],
  [
    "My friend asked me 'if you could have any superpower in the world, what would it be'",
    "I answered 'cold war Russia'"
  ],
  [
    "Letting go of a loved one can be hard but sometimes it’s the only way to survive a rock climbing catastrophe."
  ],
  ["A good book is like a puppy.", "Easy to pick up but hard to put down."],
  [
    "I once caught myself in a cycle of masturbation when I found out about my fetish for wrist pain."
  ],
  ["Whenever I think about the past it just brings back so many memories."],
  [
    "There’s a fine line between phishing and just standing on the shore like an idiot."
  ],
  ["I can levitate birds but nobody cares."],
  ["I took a lie detector test. No I didn't."],
  [
    "I told my girlfriend I was going out for a walk. ",
    "She said how long will you be gone? I said the whole time."
  ],
  ["I saw a poster that said 'lost 50 dollars, if found just keep it'"],
  [
    "Sponges grow in the ocean.",
    "I’d like to know how much deeper the ocean would be if that didn't happen."
  ],
  [
    "My friend couldn't afford to pay his water bill, so I sent him a 'get well soon' card."
  ],
  [
    "To the person who stole my Microsoft Office license.",
    "I’m gonna find you. You have my Word."
  ],
  ["Does every sentence need to include a vegetable?", "Not neccescelery."],
  ["Everyone was excited at the Autopsy club.", "It was open Mike night."],
  [
    "I replaced our bed with a king-sized trampoline.",
    "When she finds out, my wife is going to hit the roof."
  ],
  [
    "I asked the librarian if books about paranoia were available.",
    "She looked up and whispered, 'They're right behind you'."
  ],
  [
    "Boss: you’re fired",
    "Me: turns in my gun and my badge",
    "Boss: you’re a waiter here, where did you get those."
  ],
  [
    "My girlfriend told me that I'm pretty.",
    "Well, the whole sentence was \"you're pretty annoying\", but I focus only on the positive things."
  ],
  [
    "If there’s one thing that always makes me throw up...",
    "It’s a dart board on the ceiling."
  ],
  [
    "Genie: I shall grant you 3 wishes",
    "Me: I wish for a world without lawyers",
    "Genie: Done, you have no more wishes",
    "Me: But you said 3",
    "Genie: Sue me."
  ],
  [
    "I had a vasectomy because I didn't want any kids.",
    "When I got home, they were still there."
  ],
  [
    "Cop: you’re going to prison for forgery",
    "Me: (slides him a 37 dollar bill) what about now."
  ],
  [
    "Therapist: Have you ever had a job?",
    "Me: I once worked at a zoo",
    "Therapist: Great! And what did you take from that?",
    "Me: Definitely not a Penguin",
    "Therapist: what",
    "Me: what"
  ],
  [
    "My wife is blaming me for ruining her birthday",
    "That’s ridiculous, I didn't even know it was her birthday."
  ],
  ["My wife said \"nothing rhymes with orange\", I said \"no it doesn't\"."],
  [
    "Waiter: 'How do you like your steak, sir'?",
    "Sir: 'Like winning an argument with my wife'. ",
    "Waiter 'Rare it is!'."
  ],
  [
    "I went to a job interview today and the interviewer asked me 'what is your greatest weakness?'.",
    "I said 'I am too honest'",
    "He said 'I don't think that's a weakness'",
    "'Well I don't give a f*ck what you think'"
  ],
  [
    "I went to a deli and said, I'd like to buy a bagel with cream cheese.",
    "The kid behind the counter said, sorry we only take cash or credit cards."
  ],
  [
    "I hate spelling errors",
    "You mix up two letters and your whole one liner is urined."
  ],
  [
    "There was once a king who was only 12 inches tall!",
    "Terrible king, but made a great ruler."
  ],
  [
    "My wife tells me I have 2 major faults,",
    "I don't listen - and something else."
  ],
  [
    "I was wondering if I should go to work today, and then I saw some guys putting up a giant rectangle along the highway.",
    "It was a sign."
  ],
  [
    "I called up my landlord and said, \"Hey, I gotta leak in my sink.\"",
    "He sid, \"Go ahead, I'm not judging you.\""
  ],
  [
    "I told my wife I wanted to be cremated.",
    "She made me an appointment for Tuesday."
  ],
  [
    "It ook my new girlfriend out on our first date to the ice rink, and entry was half price.\"",
    "She called me a cheap skate."
  ],
  ["Waiter, my soup is cold!", "It's gazpacho.", "Gazpacho, my soup is cold."],
  [
    "We argued all day about what to call a medieval soldier",
    "But it was getting late so we called it a knight"
  ],
  ["My daughter asked me 'What is a unit of power?'", "I replied 'correct'."],
  [
    "My daughter told me she saw a deer on the way to school.",
    "Me: 'How do you know it was going to school?'"
  ],
  [
    "Did you know Stephen King has a son named Joe?",
    "I’m not joking, but he is."
  ],
  [
    "I was sitting on the toilet, angry, and late for work.",
    "I thought, 'I don't have time for this shit."
  ],
  ["My daughter told me nothing rhymes with orange. I told her she’s wrong."],
  ["I overdosed on viagra the other day", "It was the hardest day of my life."],
  [
    "I hate when my wife gets mad at me for being lazy. ",
    "It’s not like I did anything."
  ],
  [
    "Her: 'Why do we need walkie-talkies? Our relationship is over.'",
    "Me: 'Our relationship is what? Over.'"
  ],
  [
    "My friend was bragging that his new 3D printer can print a gun.",
    "Big deal. I have had a Canon printer for years."
  ],
  [
    "A man is told the local bank offers mortgages with no interest.",
    "The man enters the bank.",
    "Man: I’m here to find out about the mortgage.",
    "Bank manager: I don't really care."
  ],
  [
    "I got fired from my job at the calendar factory.",
    "All I did was take a day off."
  ],
  ["My doctor told me I'm going deaf.", "The news was hard for me to hear."],
  [
    "Two giant windmills are out on a hilltop.",
    "One turns to the other and asks, 'What kind of music do you like? '",
    "The other one says, 'I'm a really big metal fan.'"
  ],
  [
    "A man walks in to a bar with a piece of asphalt.",
    "The man says to the bartender 'One for me, and one for the road'."
  ],
  [
    "I have a photograph of me and the lead singer of REM ....",
    "That's me in the corner and that's him in the spotlight."
  ],
  ["Just sold my homing pigeon on eBay for the 22nd time."],
  ["Having a dog named 'Shark' at the beach was a bad idea."],
  ["Procrastination is the art of keeping up with yesterday."],
  ["87% of gym members don't know it’s closed."],
  ["I child-proofed my house but the kids still get in."],
  ["There’s no way that everybody was kung-fu fighting."],
  ["Went to the air and space museum but there was nothing there."],
  ["The first 5 days after the weekend are the hardest."],
  ["I call my horse Mayo and sometimes Mayo neighs."],
  ["Haikus are easy ", "but they do not make any sense ", "refrigerator."],
  ["Dogs can't operate MRI scanners but cat’s can."],
  ["All those who believe in psychokinesis raise my hand."],
  ["What if soy milk is just regular milk introducing itself in Spanish?"],
  [
    "I just got a job in a factory making plastic Draculas.",
    "There are only two of us on the production line, so I have to make every second count."
  ],
  [
    "Checking in for a flight, I was asked, 'Window or Aisle?'",
    "I said, 'Window or you'll do what?"
  ],
  [
    "You really should try archery while blindfolded.",
    "You don't know what you're missing."
  ],
  [
    "Whenever my wife is upset I let her color in my black and white tattoos.",
    "She just really needed a shoulder to crayon."
  ],
  [
    "Two cowboys are lost in the desert.",
    "One cowboy sees a tree that's draped in bacon.",
    "'A bacon tree! We're saved!' He says.",
    "He runs up to the tree and is shot up with bullets.",
    "It wasn't a bacon tree. It was a ham bush."
  ],
  [
    "I found out my girlfriend is really a ghost.",
    "I had my suspicions the moment she walked through the door."
  ],
  [
    "I dated a girl who was a twin. ",
    "People asked how I told them apart. It’s simple Mary paints her nails pink and Mike has a dick."
  ],
  ["Maybe broccoli doesn't like you either."],
  ["Feeling a bit paranoid? Remember... you are not alone."],
  ["I hate peer pressure! And so should you."],
  ["A cardiology video is totally clips of the heart."],
  ["I just can't handle automatic doors."],
  ["Oxygen and magnesium are dating. OMg!"],
  ["Be careful when you eat at Sam & Ella’s diner."],
  ["If you stand by the sea it sounds like putting a shell to your ear."],
  ["Water is heavier than butane because butane is a lighter fluid."],
  ["Welcome to assumption club! I think we all know why we’re here."],
  ["Somebody’s therapist knows all about you."],
  ["To the thief who took my anti-depressants: I hope you’re happy."],
  ["A bike in town keeps running me over. It’s a vicious cycle."],
  ["The cashiers around here are always checking me out."],
  ["Those who insert animal names in words are hippocrites."],
  ["I never finish anything. I have a black belt in partial arts."],
  [
    "I bought coconut shampoo the other day, but when I got home I realized…",
    "I don't even own a coconut."
  ],
  [
    "A buddy of mine named his dog ‘5 miles’ so he could tell people he walked 5 miles.",
    "But today he ran over 5 miles."
  ],
  [
    "My wife wants me to blow air on her whenever she overheats.",
    "But honestly, I’m not a fan."
  ],
  [
    "The institute for unfinished research has conclude that 6 out of 10 people"
  ],
  [
    "A hole was found in a nudist camp wall and the police are now looking into it."
  ],
  [
    "My wife said 'You really have no sense of direction do you?'",
    "I said 'where did that come from?'"
  ],
  [
    "'Sarcasm doesn't get you anywhere.'",
    "Me: well it got me to the sarcasm world championships in Mexico ‘98. ",
    "'Really?'",
    "Me: 'No.'"
  ],
  [
    "My therapist said that my narcissism causes me to misread social situations.",
    "I’m pretty sure she was hitting on me."
  ],
  ["I just found out I’m colorblind.", "The news came out of the purple."],
  ["I hate when people exaggerate.", "I hear it a million times a day."],
  [
    "My friend Jack claims he can communicate with vegetables.",
    "Jack and the beans talk."
  ],
  ["The dyslexic devil worshipper sold his soul to Santa."],
  [
    "As I handed my Dad his 50th birthday card, he looked at me with tears in his eyes and said, 'You know, one would have been enough.'"
  ],
  [
    "My daughter asked me if I had seen the dog bowl.",
    "I said, 'No, I didn’t even know he could.”"
  ],
  [
    "I was on a diabetes awareness website and it asked me if I accept cookies...",
    "Is this a trick question?"
  ],
  ["Horse walks into a bar.", "Bartender: Hey.", "Horse: Sure."],
  [
    "My wife said, 'You really have no sense of direction, do you?'",
    "I said, 'Where did that come from?'"
  ],
  ["I have 2 unwritten rules.", "1.", "2."],
  [
    "My wife dated a clown before she started going out with me.",
    "I had some pretty big shoes to fill."
  ],
  [
    "I asked my wife if I am the only one she has ever been with.",
    "She said yes, all the others were nines and tens."
  ],
  [
    "I was reading a great book about an immortal cat the other day.",
    "It was impossible to put down."
  ],
  [
    "I visited my new friend in his apartment.",
    "He told me to make myself at home.",
    "So I threw him out. I hate visitors."
  ],
  [
    "I’ve often heard that 'icy' is one of the easiest words to spell.",
    "Looking back at it now, I see why."
  ],
  ["If a Viking is reincarnated, Is he Bjorn again?"],
  [
    "Waiter: Do you wanna box for your leftover food?",
    "Dad: No thanks, but I'll wrestle you for them."
  ],
  [
    "My wife told me: Sex is better on holiday.",
    "I wasn't expecting that on the postcard she sent from Greece."
  ],
  [
    "Elton John bought his pet rabbit to the gym...",
    "'It's a little fit bunny....'"
  ],
  [
    "Sad news.",
    "I broke up with my girlfriend Lorraine because I was seeing another girl named Claire Lee.",
    "But the good news is that I can see Claire Lee now that Lorraine is gone."
  ],
  [
    "For the 10th year in a row, my coworkers voted me 'the most secretive guy' in the office.",
    "I can't tell you how much this award means to me."
  ],
  [
    "I gave my friend an apple, and he told me he preferred pears.",
    "So I gave him another apple."
  ],
  [
    "My wife and I always fight over the right way to hang the toilet paper roll.",
    "So our therapist suggested we try the other person's way for a week. You know. Roll reversal."
  ],
  [
    "Interviewer: How do you explain this 4 year gap on your resume?",
    "Me: That's when I went to Yale..",
    "Interviewer: That's impressive. You are hired.",
    "Me: Thanks. I really need this yob."
  ],
  [
    "An elderly couple is in church. The wife says to the husband, \"I've let out one of those silent farts, what do I do?\"",
    "The husband says, 'Change the battery in your hearing aid.\""
  ],
  [
    "What’s the most effective way to remember your wife’s birthday? Forget it once."
  ],
  [
    "The Earth's surface is 70% water. That water is uncarbonated. Therefore, the Earth is flat."
  ],
  [
    "I said to the customer, \"So you'd like a steak?\"",
    "\"Yes,\" He said. \"Well done.\"",
    "\"Thank you,\" I said."
  ],
  [
    "Tomorrow my son and I are getting new glasses. And after that?",
    "We'll see."
  ],
  [
    "My wife asked me \"is it just me or is the cat getting fat?\"",
    "Apparently \"no it's just you\" wasn't the right answer."
  ],
  [
    "Vladimir Putin is at an airport and is going through customs.",
    "Customs officer: Occupation?",
    "Putin: No, just visiting."
  ],
  [
    "I am trying to convince my dad to get a new hearing aid.",
    "But he just won't listen."
  ],
  [
    "Dad to his son; 'Do you want to hear a really good Batman impression!?\"",
    "Son; 'Go on, then.",
    "Dad growls; 'NOOOOO, NOT THE KRYPTONITE!\"",
    "Son; \"That's Superman.\"",
    "Dad: \"Thanks, I've been practicing a lot\""
  ],
  [
    "I heard that by law you need to turn on your headlights when it's raining in Sweden.",
    "How the hell am I supposed to know when it's raining in Sweden?"
  ],
  [
    "l asked the surgeon if I could administer my own anaesthetic.",
    "He said: \"Sure, knock yourself out!\""
  ],
  [
    "Doctor: Relax, David. It’s just a small surgery, don’t panic.",
    "Me: But my name isn’t David.",
    "Doctor: I know. I’m David."
  ],
  [
    "Ladies, if he can't appreciate your fruit jokes, you need..",
    "... to let that mango."
  ],
  [
    "Did you hear about the watchmaker who is half Spanish and half Irish?",
    "His name is Juan O'Clock."
  ],
  [
    "My wife says the salads I make tend to be a bit on the 'dry” side.",
    "It’s definitely something that needs addressing."
  ],
  [
    "I was sitting on the toilet, angry, and late for work.",
    "I thought, \"I don't have time for this shit.\""
  ],
  [
    "My email password got hacked again.",
    "That's the third time I've had to rename the cat."
  ],
  ["As I put my car in reverse, I thought to myself...'This takes me back.”"],
  [
    "My son, Luke, loves how I named our kids after Star Wars characters...",
    "My daughter, Chewbacca, not so much."
  ],
  ["I’m not a competitive person...", "I’ll be the first to admit it."],
  [
    "I asked an electrician to fix an electrical issue at my house",
    "He refused."
  ],
  [
    "I was browsing in a liquor store when an employee asked me 'Do you need help?”",
    "I said, 'Yes, but I’m here to get whiskey instead.”"
  ],
  [
    "Why don’t some couples go to the gym?",
    "Because some relationships don’t work out."
  ],
  [
    "As suspected, someone has been adding soil to my garden.",
    "The plot thickens."
  ],
  [
    "My therapist says I have a preoccupation with vengeance.",
    "We’ll see about that."
  ],
  ["Every single morning I get hit by the same bike.", "It's a vicious cycle."],
  [
    "A policeman spotted an elderly lady driving while knitting.",
    "\"Pullover!\" he said.",
    "\"No it's a scarf!\" she replied"
  ],
  ["If you rearrange the letters of MAILMEN they get really upset."],
  ["How many mexicans does it take to change a light bulb?", "Just Juan."],
  ["Someone stole my mood ring.", "I don't know how I feel about that."],
  [
    "Can someone please tell me what the lowest rank in the army is?",
    "Every time I ask someone, they tell me \"it's private\"."
  ],
  [
    "I had the worst dream last night.",
    "The ghost of Gloria Gaynor appeared in front of my bed.",
    "At first I was afraid, then I was petrified."
  ],
  ["How do you spot a blind man at a nude beach?", "It's not hard."],
  [
    "Recently, a fortune teller told me that in about 12 years I would suffer a terrible heartbreak.",
    "So to cheer myself up, I bought a puppy."
  ],
  [
    "I am giving up drinking for a month.",
    "Sorry, that came out wrong.",
    "I am giving up. Drinking for a month."
  ],
  [
    "My wife suggested I get a telescope, since I was interested in astronomy.",
    "I told her I'd look into it."
  ],
  [
    "I got fired from the keyboard factory today...",
    "They told me I wasn't putting in enough shifts."
  ],
  [
    "My wife left me for another man.",
    "All that lies ahead from now on is a miserable, pointless life.",
    "And while  he's going through that, I'll be down in the pub with my mates every night."
  ],
  [
    "My wife hit me with a baguette yesterday...",
    "I told her she was going  to jail for assault with a breadly weapon."
  ],
  [
    "Which body part is the most reliable?",
    "You can always count on your fingers."
  ],
  ["What do you get when you cross a chicken with a fox?", "A fox."],
  [
    "I quit my job after my boss started paying me in vegetables.",
    "I could not live off that celery."
  ],
  [
    "I haven't sold a single copy of my autobiography.",
    "That's the story of my life."
  ],
  [
    "Genie: \"What's your first wish?\"",
    "Steve: \"I wish I was rich\"",
    "Genie: \"What's your second wish, Rich?\""
  ],
  [
    "I asked my wife when her birthday was.",
    "She said March 1st.",
    "So I walked around the house and asked again."
  ],
  ["I have a fear of speed bumbs. But I'm slowly getting over it."],
  [
    "Boss: \"How good are you at Power Point?\"",
    "Me: \"I excel at it.\"",
    "Boss: \"Was that a Microsoft Office pun?\"",
    "Me: \"Word.\""
  ],
  [
    "My neighbour has two Dobermans named Rolex and Seiko.",
    "They are watch dogs."
  ],
  ["I go to the toilet for two reasons. Number one and number two."],
  [
    "I walked down the street dressed as a screwdriver.",
    "I turned a few heads."
  ],
  [
    "There's a reason  why Daniel Craig has greying hair in the latest Bond movie. He had no time to dye."
  ],
  [
    "When I get into work I immediately hide.",
    "Good employees are hard to find."
  ],
  ["My wife says I'm cheap.", "But I'm not buying it."],
  ["Tequila may not be the answer. ", "But it's definitely worth a shot."],
  ["An armed man ran into a real estate agency and shouted: \"Nobody move!\""],
  [
    "I'd like to have kids one day...",
    "I don't think I could stand them any longer than that though."
  ],
  ["I told my son he shouldn't listen to losers.", "Now he won't talk to me."],
  [
    "I wrote a book on how to fall down the stairs.",
    "It’s a step by step guide."
  ],
  [
    "The Egyptians claim there are no crocodiles in their country.",
    "I think they're in de Nile."
  ],
  [
    "Did you hear about the pole vault champion of North Korea?",
    "He’s now the pole vault champion of South Korea."
  ],
  [
    "To everyone out there suffering from paranoia.",
    "Just remember you’re not alone."
  ],
  [
    "I went to a bookstore and saw a book titled \"How to solve 50% of your problems\". I bought 2."
  ],
  [
    "I told my girlfriend I think she's cheating on me.",
    "She told me I sound just like her husband."
  ],
  ["Never share a secret with a clock.", "Time will tell."],
  ["Somebody said my dad's gay.", "And I’m now trying to work out which one."],
  [
    "I invented a car that only moves when you're silent.",
    "It really goes without saying."
  ],
  [
    "I was abducted by aliens. ",
    "They made me wash my hands, clean my room, and eat my vegetables.",
    "Turns out I was on the mothership."
  ],
  [
    "I never thought orthopaedic shoes really would work for me.",
    "But I stand corrected."
  ],
  [
    "I have a feeling that I’ll be fired from my job at the graffiti removal company.",
    "The writing is on the wall."
  ],
  ["My wallet is like an onion.", "When I open it, it makes me cry."],
  ["I used to be addicted to time travel.", "But that’s all in the past now."],
  ["It takes guts to be an organ donor."],
  ["I’m not wearing glasses anymore.", "I’ve seen enough."],
  ["My horse has insomnia and keeps everyone awake.", "She’s a nightmare."],
  [
    "I bought a dog off a blacksmith today and as soon as I got home, it made a bolt for the door."
  ],
  ["I am so poor, I can't even pay attention."],
  ["Can anyone tell me what oblivious means?", "I have no idea."],
  [
    "I told my wife she needs to start embracing her mistakes.",
    "So she hugged me."
  ],
  [
    "I was shocked the other day when I thought I heard my girlfriend say she wanted to go to see The Monkees tribute band in Switzerland.",
    "Then I saw her face - now I’m in Geneva."
  ],
  [
    "85% of people don’t know how to do basic math.",
    "Thank God I’m part of the other 25%."
  ],
  ["When I was kid my social network was called “outside”."],
  ["Don’t use double negatives.", "They’re a big no no."],
  ["My niece calls me Ankle.", "I call her my Knees."],
  [
    "I saw my first porn film last week.",
    "I couldn’t believe how young I looked."
  ],
  [
    "Gravity is one of the most fundamental forces in the universe, but if you remove it, you get gravy."
  ],
  ["I taught my pet wolf how to meditate...", "Now he's aware wolf."],
  [
    "I had a game of quiet tennis today. ",
    "It’s just like regular tennis but without the racket."
  ],
  ["Tequila may not fix your life.", "But it’s worth a shot."],
  [
    "Just got hospitalised due to a peekaboo accident.",
    "They put me in the ICU."
  ],
  [
    "My teeth were stained, so the dentist asked me, \"do you smoke or drink coffee?\".",
    "I told him I drink it."
  ],
  [
    "Got drunk yesterday and threw up in the elevator on my way back home.",
    "It was disgusting on so many levels."
  ],
  [
    "When your girlfriend comes home in a white suit, covered in bee stings and smelling like honey.",
    "You know she's a keeper."
  ],
  [
    "My chiropractor and I got into this terrible fight in the middle of my neck treatment.",
    "Now I have to spend the rest of my life looking over my shoulder."
  ],
  [
    "I’ve been reading a book called \"How To Use A Ladder\"",
    "Well, it’s more of a step-by-step guide."
  ],
  [
    "I told the doctor's receptionist I need an appointment.",
    "\"How about 10 tomorrow?\", she asked.",
    "\"I don't need that many\", I replied"
  ],
  [
    "My girlfriend says I’m way too condescending...",
    "(That means I speak down to people)"
  ],
  [
    "I told my boss, \"Sorry I'm late, I was having computer issues.\"",
    "Boss: \"Hard drive?\"",
    "Me: \"No, the commute was fine, it's my laptop.\""
  ],
  [
    "A man walks in to the doctors all panicked \"Doctor I'm shrinking!\"",
    "The doctor replies \"well sir you're just going to be a little patient\""
  ],
  [
    "On rainy days, my wife thinks it's pathetic when I stare through the window.",
    "It would be less pathetic if she just let me in."
  ],
  [
    "Two robbers were robbing a liquor store when one robber grabs a bottle and asks the other robber \"is this whiskey?\"",
    "The other says \"yeah but not as whiskey as wobbing a bank\"."
  ],
  [
    "My wife threatened to divorce me when I said I was going to give our daughter a silly name...",
    "So I called her Bluff..."
  ],
  [
    "Got home from work today to find my kids have been on ebay all day.",
    "If they are still there tomorrow I will lower the price."
  ],
  [
    "I went for an interview for a job today and the manager said, \"We’re looking for someone who’s responsible.”",
    "\"Well, I’m your man.” I replied, \"In my last job, whenever anything went wrong, they said I was responsible.”"
  ],
  ["What do you call a one-legged hippo?", "A hoppo."],
  [
    "I accidentally swallowed a bunch of Scrabble tiles...",
    "My next trip to the bathroom could spell disaster!"
  ],
  [
    "I have the attention of a goldfish.",
    "Seriously, it’s been watching me for hours."
  ],
  [
    "My friend Tony asked me not to say his name backwards.",
    "I asked, \"Y not?\""
  ],
  [
    "I can cut a log in half just by looking at it.",
    "I know it is hard to believe me but I saw it with my own two eyes."
  ],
  [
    "The doc asked me if I reduced the cigarettes that I smoke.",
    "\"Yes,\" I replied. \"They're definitely shorter by the time I've finished them.\""
  ],
  [
    "My friend writes songs about sewing machines.",
    "He's a Singer songwriter."
  ],
  [
    "I told my wife I wanted to be cremated.",
    "She made an appointment for Tuesday."
  ],
  ["What time machine?", "", "Watch out for the time machine!"],
  ["What did Yoda say when he saw himself in 4K?", "HDMI"],
  [
    "My massage therapist got fired...",
    "I guess she rubbed too many people up the wrong way."
  ],
  [
    "My wife took off her shirt and bra during an argument where I was winning.",
    "It was a booby trap."
  ],
  [
    "After all these years, my wife still thinks I’m sexy.",
    "Every time I walk by she says: \"What an ass!\""
  ],
  [
    "The cop asked, \"Whose car is this? Where are you headed? What do you do?\"",
    "The miner replied, \"Mine.\""
  ],
  [
    "My girlfriend poked me in the eyes...",
    "...so I stopped seeing her for a while."
  ],
  ["Sometimes I talk to myself when I'm alone and it's kinda sad.", "Me too."],
  [
    "My girlfriend gets mad whenever I mess with her red wine.",
    "So I added fruit and lemonade to it and now she’s sangria then ever."
  ],
  [
    "I went to see the doctor about my blocked ear.",
    "\"Which ear is it?\" he asked.",
    "\"2025,\" I replied."
  ],
  [
    "My girlfriend's cellphone service sucks!",
    "Eight days ago she said, \"We're breaking up,\" the call ended and it's gone straight to voicemail ever since."
  ],
  [
    "Somebody should market a beer called \"Occasionally\".",
    "So when asked, I can say, \"I only drink occasionally\"."
  ],
  [
    "Y’all have heard of Murphy’s Law right? Anything that can go wrong, will go wrong. But have you heard about Coles Law?",
    "It’s a bunch of thinly sliced cabbage with a mayonnaise based dressing."
  ],
  ["To the person who stole my place in the queue.", "I’m after you now."],
  [
    "I got trapped in a bidding war for a house, because my wife loved the lengthy corridor.",
    "Now I’m in it for the long hall."
  ],
  [
    "My wife warned me that if I take another picture of her, she’ll be furious.",
    "That’s when I snapped!"
  ],
  [
    "Insomnia is awful.",
    "On the plus side, only three more sleeps until Christmas"
  ],
  [
    "I recently joined a nudist colony.",
    "The first few days were the hardest..."
  ],
  [
    "I went for an interview at IKEA.",
    "The manager greeted me by saying \"come in, make a seat.\""
  ],
  [
    "My wife told me she thought we’d have less arguments if I wasn’t so pedantic.",
    "I told her. \"I think you mean fewer\"."
  ],
  [
    "There once was a man that fell down a well.",
    "Turns out, he couldn't see that well."
  ],
  [
    "Unfortunately, my obese parrot just died. But it’s a huge weight off my shoulders."
  ],
  ["\"My memory is so bad.\"", "\"How bad is it?\"", "\"How bad is what?\""],
  [
    "My ability to remember song lyrics from the ‘80s far exceeds my ability to remember why I usually walk into the kitchen."
  ],
  [
    "Me: Can I leave work early?",
    "Boss: Only if you make up the time.",
    "Me: OK 45 past 60. ",
    "Boss: You’re fired."
  ],
  [
    "My wife thinks it’s weird that I stare at the window during a heavy rainstorm.",
    "It would be a lot less weird if she’d just let me in."
  ],
  [
    "Today, I saw someone waving and I wasn’t sure whether they were waving at me or at someone behind me.",
    "In other news, I was fired from my lifeguard job."
  ],
  [
    "My dad was bragging about his new hearing aid. \"State of the Art,\" he said, \"It cost me a fortune.\"",
    "I asked: \"Awesome what type is it?\"",
    "He said: \"Two thirty.\""
  ],
  [
    "I went to the zoo and saw a baguette in a cage.",
    "The zoo keeper told me it was bread in captivity."
  ],
  [
    "Bouncer: \"I'm going to have to ask you to leave.\"",
    "“Why?”",
    "“I don’t know who you are and this is my trampoline.”"
  ],
  [
    "I wanted to thank everyone for sticking with me while I figured out the meaning of \"many\".",
    "It means a lot."
  ],
  ["Today someone told me that I’m average.", "I told them that’s just mean."],
  [
    "What does Arnold Schwarzenegger say at the beginning of a game of chess?",
    "\"I'll be black.\""
  ],
  [
    "Her: It’s not working out between us. For starters, I’m sick of your terrible jokes.",
    "Me: I understand. And for the main course?"
  ],
  [
    "Once my dog ate all the Scrabble tiles.",
    "For days he kept leaving little messages around the house."
  ],
  [
    "Did you hear that Fedex and UPS were merging?",
    "They’re going to be called FedUps."
  ],
  [
    "Man: \"Waitress, can I ask you something about the menu please\"",
    "Waitress: *slaps his face*",
    "\"The men I please are none of your damn business!\""
  ],
  [
    "\"Dad, can I eat the cake in the fridge?\"",
    "\"Sure, but the dining room would probably be more comfortable.\""
  ],
  [
    "I have this weird talent where I can identify what’s inside a wrapped present. It’s a gift."
  ],
  [
    "Me: I'm not saying a word without my lawyer present.",
    "Cop: You ARE the lawyer.",
    "Lawyer: So where’s my present?"
  ],
  [
    "My wife asked me: \"What starts with F and ends in K.\"",
    "I said: \"No it doesn’t.\""
  ],
  [
    "My housemates are convinced our house is haunted.",
    "I’ve lived here for 274 years and not noticed anything strange."
  ],
  [
    "My wife is blaming me for ruining her birthday.",
    "That’s ridiculous, I didn’t even know it was her birthday."
  ],
  [
    "I’ve trained my dog to go and fetch me a bottle of wine.",
    "He’s a Bordeaux collie."
  ],
  [
    "I sent my hearing aids for repair 2 weeks ago.",
    "Haven't heard anything since."
  ],
  [
    "I'm in a band called Dyslexia.",
    "We've just released our Greatest Shit album."
  ],
  ["What is the hardest cult to join?", "The diffi-cult."],
  [
    "My wife and I had a huge argument as to whose turn it was to do laundry.",
    "Eventually, I folded."
  ],
  [
    "My wife complains I don’t buy her flowers.",
    "To be honest, I didn’t know she sold flowers."
  ],
  [
    "Two guys are playing chess.",
    "One says to the other, \"How about we make this more interesting?\"",
    "So they stop playing chess."
  ],
  [
    "I went to the doctor and he said, \"You've got hypochondria.\"",
    "I said, \"Not that as well.\""
  ],
  [
    "“As one door closes, another one opens,” he said.",
    "“That's all well and good,” I said, “But until you fix it, I'm not buying the car.”"
  ],
  [
    "Found out my wife is cheating on me today. ",
    "When I asked when she’d be home she said, “10-15 minutes max.”",
    "My name is Stephen."
  ],
  [
    "My friend was bragging that his 3D printer can print a gun but I wasn’t impressed.",
    "I had a Canon printer for years."
  ],
  [
    "The inventor of the jigsaw puzzle died yesterday. ",
    "His wife is said to be in 1500 pieces."
  ],
  ["Who can drink 5 litres of petrol and not get sick?", "Jerry Can."],
  [
    "A man goes to a funeral and asks the widow: Mind if I say a word?\" She says: \"Please do.\" ",
    "The man clears his throat and says: \"Bargain.\"",
    "The widow replies: “Thanks that means a great deal.”"
  ],
  ["What word becomes shorter when you add two letters to it?", "Short."],
  [
    "I’m organising a charity ball next week for people who struggle to reach orgasm.",
    "Just let me know if you can’t come."
  ],
  [
    "\"I went to the doctor and he said, 'You've got hypochondria.'",
    "I said, 'Not that as well.'”"
  ],
  [
    "Doctor, doctor . . . All five of my boys want to be valets when they grow up!",
    "Doctor: Sounds like a really bad case of parking sons disease."
  ],
  [
    "My wife asked me to go get 6 cans of Sprite from the grocery store.",
    "I realized when I got home that I had picked 7 up."
  ],
  [
    "The first annual meeting of camouflage club was a disaster.",
    "It looks like no one showed up."
  ],
  [
    "My wife wants me to blow air on her whenever she overheats, but honestly...",
    "... I'm not a fan."
  ],
  [
    "I joined a gym and said to the trainer, “I want to impress beautiful girls, which machine should I use?”",
    "“Try the ATM outside,” he said."
  ],
  ["What do priests say to get rid of insects in the church?", "Let us spray."],
  [
    "Sorry sir, we don't serve time travelers here.",
    "A time traveller walks into a bar."
  ],
  [
    "I've just invented a telepathically controlled air freshener.",
    "Makes scents when you think about it."
  ],
  [
    "Bruce Lee was fast, but he had an even faster brother...",
    "...Sudden Lee."
  ],
  [
    "I am getting a little sick of my wife complaining that I sit around and do nothing all weekend.",
    "I’m not going to stand for it."
  ],
  [
    "My grandfather always used to say “as one door closes another one opens.”",
    "Great guy.",
    "Terrible carpenter."
  ],
  [
    "Got pulled over today and the cop asked if I know why he pulled me over.",
    "I replied: \"is it because you want to see how tall I am?\"",
    "He said: \"step out of the car sir\"",
    "See, I knew it."
  ],
  [
    "My Grandma always used to say, \"An apple a day keeps the doctor away.\"",
    "I don't know if that's true, or just one of Granny's myths."
  ],
  [
    "My wife claims that men in camouflage look really sexy.",
    "I just can’t see it."
  ],
  [
    "I asked Dad how he plans to spend the day.",
    "He said, \"first, Mom and I will go pick up our prescription glasses, and then we’ll see."
  ],
  [
    "My roommate says our apartment is haunted by ghosts.",
    "But I've never seen any ghosts, and I've lived in this apartment for over a century."
  ],
  [
    "If we are to be serious about saving the planet, we should stop printing calendars.",
    "They're the reason our days are numbered."
  ],
  [
    "What do you call a man that has been married and divorced multiple times?",
    "Lord of the Rings."
  ],
  [
    "Doctor you've got to help me, I'm addicted to twitter.",
    "Doctor: I don't follow you."
  ],
  [
    "Some idiot glued every card in my deck together so now it’s just a block of cardboard.",
    "I'm having trouble dealing with it."
  ],
  [
    "I called Animal Welfare today and said, \"I've just found a suitcase in the woods containing four kittens.\"",
    "“That's terrible,\" she replied, \"Are they moving?”",
    "“I'm not sure, to be honest\" I said, \"But if they were that would explain the suitcase.”"
  ],
  [
    "Dentist: “When was the last time you flossed?”",
    "Shaking my head. “Dude, you were there!”"
  ],
  [
    "I joined a dating site for arsonists.",
    "I've been getting a lot of matches."
  ],
  [
    "I accidentally drank some Holy Water with my laxative.",
    "I'm about to start a religious movement."
  ],
  [
    "I recently ran an ultra marathon in northern Sweden...",
    "I realised that I had gone way off course as soon as I crossed the Finnish line."
  ],
  [
    "Three weeks ago I sent my hearing aid in for repair. ",
    "I’ve heard nothing since."
  ],
  [
    "Waiter: I see your glass is empty, would you like another one?",
    "Dad: Why would I want two empty glasses?"
  ],
  [
    "My wife just told me to put the toilet seat down.",
    "I don’t know why I was carrying it around in the first place."
  ],
  [
    "My wife asked me “is it just me or is the cat getting fat?”",
    "Apparently “no it’s just you” wasn’t the right answer."
  ],
  [
    "I asked my wife suggestions for an exercise routine. She said, “Why don’t you try lunges?”",
    "I said: “That’s a...big step.”"
  ],
  [
    "My wife threatened to leave me because of my “filthy and disgusting habits.”",
    "I was so shocked I nearly choked on my toenails."
  ],
  [
    "Im so bored sitting at home that I decided to memorize six pages of the dictionary.",
    "I learned next to nothing."
  ],
  [
    "My kids refused to eat leftover tacos for dinner, so my wife asked me to throw them out.",
    "I did. Now I have no idea what to do with the tacos."
  ],
  [
    "Someone just called my phone, sneezed and then hung up.",
    "I’m getting sick and tired of these cold calls."
  ],
  [
    "I said to my wife \"When I die,\" I'd like to die having sex\"",
    "She replied: “At least it’ll be quick.”"
  ],
  [
    "My wife said to me: \"If you won the lottery, would you still love me?\"",
    "I said: “Of course I would. I’d miss you, but I’d still love you.”"
  ],
  [
    "Coworker: you didn't accidentally staple your balls to your desk again did you?",
    "Me: no",
    "Coworker: come here then",
    "Me: ok",
    "[sound of desk sliding across floor]"
  ],
  ["What has three legs and four arms?", "My son’s shit drawing of a snake."],
  [
    "My doctor says I have a narcissistic personality disorder.",
    "But that's impossible - as the smartest man alive I would have noticed."
  ],
  [
    "Someone told me I’m not the sharpest tool in the shed.",
    "What does that mean?"
  ],
  ["I am writing a book about reverse psychology.", "Please don't buy it."],
  [
    "After my bike accident today I lied to the X-ray technician that I was fine...",
    "But they saw right through me."
  ],
  [
    "I've just joined a dating site for arsonists. ",
    "I've been sent a lot of matches."
  ],
  [
    "My wife yelled at me this morning because the fridge was full of noodles.",
    "Apparently I was sleep wokking again."
  ],
  [
    "The first annual meeting of camouflage club was a disaster.",
    "It looks like no one showed up."
  ],
  [
    "Did you hear about the optician who made the biggest monocle in the world?",
    "It was a huge spectacle!"
  ],
  [
    "Doc: I have your diagnosis",
    "Me: Be quick doc, I don't have all day",
    "Doc: Damn who told you?"
  ],
  [
    "I opened my birthday card and loads of rice fell out...",
    "I knew right away who sent it, it was my uncle Ben."
  ],
  [
    "A man I know has a stutter and is going to prison.",
    "I’m afraid he’ll never finish his sentence."
  ],
  [
    "I asked my friend when their birthday was. He said March 1st.",
    "I stood up, walked around the room, and asked again."
  ],
  [
    "I gave my wife a glue stick instead of lipstick by accident.",
    "She's still not talking to me."
  ],
  [
    "I tried donating blood today. NEVER AGAIN!",
    "Too many stupid questions; Whose blood is it? Where did you get it from? Why is it in a bucket?"
  ],
  [
    "When I moved into my igloo, my friends threw me a house warming party.",
    "Now I'm homeless."
  ],
  [
    "My wife traumatically ripped the blankets off me last night.",
    "But I will recover."
  ],
  [
    "Me: I'm having a really good day except for newpussycat.",
    "Friend: What's newpussycat?",
    "Me: WHOAAAAA WHOAAAA ООООНННН"
  ],
  [
    "Did you hear about the surgeon who enjoyed performing quick surgeries on insects?",
    "He did one on the fly."
  ],
  [
    "I phoned the local gym instructor and asked if he could teach me the splits.",
    "He said: “How flexible are you?",
    "I replied, “I can’t make Tuesdays or Thursdays.”"
  ],
  [
    "First date.",
    "Her: Let's exchange numbers.",
    "Me: Won't that confuse people who are trying to call us?"
  ],
  [
    "My wife just texted and asked “what does IDK stand for?”",
    "I replied: “I don’t know.”",
    "She said: “Damnnnn! Nobody knows!”"
  ],
  ["I went to a Russian Bee Gees cover band concert last week.", "The KGBGs."],
  [
    "My friend was showing me his tool shed, and pointed to a ladder.",
    "\"That's my stepladder,\" he said. \"I never knew my real ladder.\""
  ],
  ["What’s huge, grey and not important?", "An irrelephant."],
  [
    "Today I found out that Dwayne Johnson lives in the apartment above mine.",
    "Can’t believe that for years I've been living under a Rock."
  ],
  ["My New Year's resolution is to procrastinate. ", "I'll start tomorrow."],
  [
    "My wife says she’s leaving me because she thinks I’m too obsessed with astronomy.",
    "What planet is she on?!"
  ],
  [
    "I accidentally drunk a bottle of invisible ink.",
    "Now I’m in hospital waiting to be seen."
  ],
  [
    "I became disgusted with bull-fighting as soon as I saw the matador’s cape.",
    "It was a big red flag."
  ],
  [
    "I was at the zoo the other day and there was only one dog in it.",
    "It was a shitzu."
  ],
  ["Which celebrity is always ready for cereal?", "Reese. With her spoon."],
  ["Who was the builder of King Arthurs round table?", "Sir Cumference."],
  [
    "There’s a 3-letter word for 24 hours, but I can’t remember it. I’m tired.",
    "I think I’ll call it a day."
  ],
  ["My wife and I laugh at how competitive we are.", "But I laugh more."],
  [
    "[Crayon conference]",
    "red: we should start by introducing ourselves, I'm red",
    "green: I'm green",
    "yellow: I'm yellow",
    "blue: *deep breath*"
  ],
  ["Therapist: \"Describe yourself in one word\"", "Me: \"No\"."],
  ["Don't burn bridges.", "Just loosen the bolts a little bit each day."],
  ["Class is over.", "Ashley: Finally", "Ashleigh: Finalleigh"],
  [
    "Robin: the Batmobile won't start.",
    "Batman: Check the battery.",
    "Robin: What's a tery?"
  ],
  ["How do you get dick from Richard?", "If you ask nicely."],
  [
    "My daughter was doing history homework and asked me what I knew about Galileo.",
    "I said \"he was a poor boy from a poor family\"."
  ],
  [
    "[first day as bartender]",
    "Customer: I'll have a martini, dry.",
    "Me, staring at all the liquid ingredients: I don't know how to tell you this."
  ],
  [
    "My geography teacher asked if I could name a country with no R in it.",
    "I said \"No way\"."
  ],
  [
    "I saw an old man getting attacked by three men so I decided to help.",
    "He didn’t stand a chance against the four of us."
  ],
  [
    "Me: \"I'd like a book about Shakespeare\"",
    "Librarian: \"Which one?\"",
    "Me: \"William\""
  ],
  [
    "I can't believe someone stole my limbo stick.",
    "Like seriously, how low can you go ?"
  ],
  [
    "Doctor: 'Sir, I have some bad news, I’m afraid your DNA is backwards'",
    "Me: 'and?'"
  ],
  ["I started a band called 'Blanket'", "It's a cover band."],
  [
    "The school phoned me today and said, 'Your son's been telling lies. '",
    "I replied,  \"Tell him he's very good. I don't have a son.\""
  ],
  [
    "They're building a mirror factory in my town.",
    "I could see myself working there."
  ],
  [
    "What do you call someone who points out the obvious?",
    "Someone who points out the obvious."
  ],
  [
    "I told my girlfriend she was drawing her eyebrows too high.",
    "She looked surprised."
  ],
  [
    "I asked my date to meet me at the gym today. She didn't show up.",
    "That’s when I knew we weren't gonna work out."
  ],
  [
    "My wife asked me today if I had seen the dog bowl.",
    "I said no I didn't know he could."
  ],
  [
    "My wife thinks we should allow our pets to share our bed.... I finally gave in.",
    "After 10 minutes, our goldfish finally settled down."
  ],
  [
    "My wife accused me of hating her family and relatives",
    "I replied, no, I don't hate your relatives. In fact, I like your mother-in-law a lot better than I like mine."
  ],
  [
    "My wife asked me, 'Did you fog up the bathroom mirror again?'",
    "I said, 'I don't see myself doing that.'"
  ],
  [
    "I stopped by a roadside stand that said lobster tails $2.",
    "I paid my $2 and the guy says 'Once upon a time there was this lobster.'"
  ],
  [
    "If Mary is the mother of Jesus and Jesus is the lamb of God",
    "Does that mean that Mary had a little lamb?"
  ],
  ["What do you call a magic dog?", "A labracadabrador"],
  [
    "A man was found dead in a vat full of falafel condiments.",
    "Police are treating it as a hummuscide."
  ],
  [
    "I don't like the term, 'anal bleaching.'",
    "I prefer, 'changing your ring tone.'"
  ],
  [
    "How much does Santa pay to park his sleigh?",
    "Nothing. It’s on the house."
  ],
  [
    "I bought a pair of shoes from a drug dealer yesterday.",
    "I don't know what he laced them with... but I’ve been tripping all day."
  ],
  [
    "What do you say to your sister when she’s crying?",
    "'Are you having a crisis?'"
  ],
  [
    "A guy came to me and said 'Man, your clothes are so gay'",
    "I said: 'I know, they came out of the closet this morning'"
  ],
  [
    "Did you hear about the viking Rudolph the Red?",
    "He looked outside and proclaimed it was going to rain.",
    "His wife asked: 'What makes you say that?'",
    "'Rudolph the Red knows rain, dear.'"
  ],
  ["What happens when frogs park illegally?", "They get toad away."],
  [
    "I scared the mailman today by coming to the door naked.",
    "I don't know what scared him most, the fact that I was naked or that I knew where he lived."
  ],
  ["I overdosed on viagra once.", "Hardest day of my life."],
  ["A storm blew away 25% of my roof last night.", "Oof."],
  [
    "The secret service isn't allowed to yell 'Get down!' Anymore when the president is about to be attacked.",
    "Now they have to yell 'Donald, duck!'"
  ],
  [
    "I made a graph for my past relationships. ",
    "It has an ex-axis and a why-axis."
  ],
  [
    "My wife is threatening to leave me because of my obsession with wearing different clothes every half an hour.",
    "I said, 'Wait, I can change.'"
  ],
  [
    "The nurse at the sperm bank asked me if I'd like to masturbate in the cup.",
    "I said, 'Well, I'm pretty good, but I don't think I'm ready to compete just yet.'"
  ],
  [
    "A shop assistant tried stopping an armed robber by attacking him with a labeling gun.",
    "Police are now looking for a man with a price on his head."
  ],
  ["I hate autocorrect.", "It always makes me say things I didn't Nintendo!"],
  [
    "We all know about Murphy’s Law – Anything that can go wrong will go wrong. But have you heard of Cole’s Law?",
    "It’s thinly sliced cabbage."
  ],
  [
    "My wife claims that a man in camouflage is really sexy.",
    "I just don't see it."
  ],
  [
    "My wife blocked me on Facebook because I post too many bird puns.",
    "Well, toucan play that game."
  ],
  ["Guess who I bumped into on my way to get my glasses fixed?", "Everybody."],
  [
    "People said I’d never get over my obsession with Phil Collins.",
    "But take a look at me now."
  ],
  ["What do you call a magician who has lost their magic?", "Ian."],
  [
    "I’m trying to learn the alphabet but I can't get past X.",
    "I don't know why."
  ],
  [
    "You know, I was looking at our ceiling the other day. It’s not the best...",
    "But it’s up there."
  ],
  [
    "My mate says I'm getting fat, but in my defence...",
    "I’ve had a lot on my plate recently."
  ],
  [
    "At the Olympics I saw an athlete carrying a long stick and asked him: 'Are you a pole vaulter?'",
    "He replied: 'No I’m German but how do you know my name is Walter?'"
  ],
  [
    "I just watched a documentary about beavers.",
    "Best dam show I’ve ever seen."
  ],
  [
    "I dreamed I saw a color I never saw before.",
    "It was just a pigment of my imagination."
  ],
  [
    "The only thing I have planned for today is to get my new glasses",
    "Then I’ll see what happens."
  ],
  [
    "Yesterday one of my good friends told me I often make people uncomfortable by violating their personal space.",
    "It was a really hurtful thing to say and completely ruined our bath."
  ],
  [
    "I just got hired at a company that makes bicycle wheels!!",
    "I’m the spokesperson."
  ],
  ["Did you know vampires aren't real?", "Unless you Count Dracula."],
  [
    "I went into a pet shop and asked for twelve bees. The shopkeeper counted out thirteen and handed them over.'You’ve given me one too many.'",
    "'That one is a freebie.'"
  ],
  [
    "I have a pen that can write underwater.",
    "It can also write other words too."
  ],
  [
    "A sweater I purchased was picking up static electricity, so I returned it to the store.",
    "They gave me another one free of charge."
  ],
  [
    "The other day I bought a thesaurus, but when I got home and opened it, all the pages were blank...",
    "I can't find the words to describe how angry I am."
  ],
  [
    "My daughter really changed a lot after becoming a vegan.",
    "It’s like I’ve never seen herbivore."
  ],
  [
    "'My wife is going into labour, what should I do?'",
    "'Is this her first child?'",
    "'No this is her husband'"
  ],
  [
    "'How do you think we keep the cars here so shiny?'",
    "'Polish?'",
    "'Sorry sir, Jak myslisz, jak trzymamy samochody tutaj tak blysczcace?'"
  ],
  ["'Coffee or tea?'", "'Coffee'", "'Wrong. It’s tea'"],
  [
    "'Can you perform under pressure?'",
    "'No, but I can try Bohemian Rhapsody?'"
  ],
  ["'What’s upstairs?'", "'Unfortunately, the stairs don't talk.'"],
  [
    "Calling twin brother from prison:",
    "'Hey bro, remember when we were kids and we would finish each other’s sentences?'"
  ],
  ["'Sir, I’m afraid your DNA is backwards'", "'AND??'"],
  ["How often do planes crash?", "Just once."],
  ["I can't find my gone in 60 seconds dvd.", "It was here a minute ago."],
  [
    "I just found out that 'Aaarghh' is not a real word.",
    "I can't express how angry I am."
  ],
  ["I used to be in a band called 'The Hinges'", "We opened for 'The Doors.'"],
  [
    "I somehow managed to make it through high school math while only being able to remember even numbers!!",
    "What are the odds?"
  ],
  ["My book on clocks finally arrived.", "It’s about time!"],
  [
    "I went to a psychic. I knocked on her front door.",
    "She yelled: 'Who is it?'",
    "So I left."
  ],
  [
    "My neighbour and I became good friends, so we decided to rent a space together to park our cars.",
    "We have....a lot in common."
  ],
  [
    "I’ve been saying 'mucho' to my Spanish friend a lot more often lately.",
    "It means a lot to him."
  ],
  ["My wife just threw away my favourite herb.", "She’s such a thyme waster."],
  [
    "My buddy said 'There's only one thing about Halloween that scares me.'",
    "I asked: 'Which is?'",
    "'Exactly!' He replied."
  ],
  [
    "So many people these days are too judgemental.",
    "I can tell just by looking at them."
  ],
  [
    "I bought a new pair of gloves today...",
    "But they’re both lefts, which on the one hand is great but on the other it’s just not right."
  ],
  [
    "My wife said she wants a divorce because I play too many video games.",
    "What a stupid thing to Fallout 4."
  ],
  [
    "A man walks into a bar with a slab of asphalt under his arm.",
    "He shouts: 'A beer please and one for the road.'"
  ],
  [
    "My wife claims she can wax my chest hair without me feeling any pain at all.",
    "I’m worried she won't be able to pull it off."
  ],
  ["I changed all my passwords to Kenny.", "Now I have all Kenny Loggins."],
  ["Bruce Lee had a vegan brother;", "Broco Lee."],
  [
    "I asked my dad, 'Can we get some pets?'",
    "He said: 'No, pets are just a step backwards.'"
  ],
  [
    "My wife is mad at the fact that I have no sense of direction.",
    "So I packed up my stuff and right."
  ],
  [
    "Man: 'Doctor I feel like a supermarket'",
    "Doctor: 'How long have you felt like this?'",
    "Man: 'Ever since I was Lidl.'"
  ],
  [
    "In 2022 I didn't jog. In 2023 I didn't jog. In 2024 I didn't jog. In 2025 I still haven't jogged.",
    "This is a running joke."
  ],
  [
    "Interviewer: Your resume says you take things too literally.",
    "Me: 'When the hell did my resume learn to talk?'"
  ],
  [
    "After I was arrested, my ex-wife decided to hang a picture of my mugshot on the wall in her living room.",
    "But she still won't admit she framed me."
  ],
  ["I was gonna tell a time traveling joke.", "But you guys didn't like it."],
  [
    "I was really embarrassed when my wife caught me playing with my son’s train set, so I threw a bedsheet over it.",
    "I think I managed to cover my tracks."
  ],
  [
    "Sometimes I put my head in between my both my legs and lean forward...",
    "...because that's how I roll."
  ],
  [
    "I broke up with my girlfriend of 5 years because I found out she was a communist.",
    "I should have known, there were red flags everywhere."
  ],
  [
    "A hungry traveller stopped at a monastery and was taken to the kitchen where there was a brother frying chips.",
    "'Are you the friar?' he asked.",
    "The brother replied, 'No, I'm the chip monk'."
  ],
  ["What do you call a bearded vase maker?", "Hairy potter."],
  [
    "Someone asked me to name two structures that hold water.",
    "I was like well damn."
  ],
  [
    "Everyone was excited to be at our autopsy club this evening.",
    "It was open Mike night."
  ],
  [
    "My neighbour rang on my doorbell at 3 in the night. Can you believe it?!",
    "Luckily I was still up playing the drums."
  ],
  [
    "I took my car to the mechanic because it was making a terrible noise.",
    "He removed the Mariah Carey Christmas CD and now it’s fine."
  ],
  [
    "I like to imagine that the guy who invented the umbrella was going to call it the brella.",
    "But he hesitated."
  ],
  [
    "A friend asked 'As a little guy, was your mum super strict with you?'...",
    "I said, 'My mum was never a little guy'."
  ],
  [
    "They said a mask would be enough to go to the supermarket...",
    "They lied, everyone else had their clothes on."
  ],
  ["My sword doesn't weigh much. ", "It’s my light saber."],
  [
    "I have started carrying a piece of stone with me to throw at people who sing Christmas songs before Thanksgiving.",
    "It’s my jingle bell rock."
  ],
  [
    "My daughter told me she saw a deer on the way to school.",
    "Me: 'How do you know it was going to school?'"
  ],
  [
    "My wife said 'you aren't even listening to me are you'.",
    "That’s a weird way to start a conversation."
  ],
  [
    "I think the girl at the Airlines check-in just threatened me.",
    "She looked me dead in the eye and said, 'Window or aisle?'",
    "I laughed in her face and replied, 'Window or you’ll what?'"
  ],
  [
    "I told my wife I’m going to arrange the herbs in alphabetical order from now on.",
    "She said, 'Where would you find the time?'",
    "I said, 'Easy. Right next to the sage.'"
  ],
  [
    "My friend said, 'My kid refuses to eat fish. What do you think is a good replacement?'",
    "Me: Cats. Cats love fish."
  ],
  [
    "The salesman at the furniture store told me, 'This sofa will seat 5 people without any problems.'",
    "I said, 'Where the hell am I going to find 5 people without any problems?'"
  ],
  [
    "My weird talent is always being able to tell what’s in a wrapped present.",
    "It’s a gift."
  ],
  [
    "When I left home to go on a business trip, my wife said 'Don't forget to write'",
    "I thought, 'That's unlikely... it's a basic skill, isn't it?'"
  ],
  [
    "The barman says, 'Sorry, we don't serve faster-than-light particles in here.'",
    "A faster-than-light particle walks into a bar."
  ],
  [
    "My wife told me she’ll slam my head on the keyboard if I don't get off the computer.",
    "I’m not too worried, I think she’s jokinlkjhfakljn m,.nbziyoao78yv87dfaoyuofaytdf"
  ],
  [
    "My girlfriend is fed up of my constant wordplay jokes, so I asked her, 'How can I stop my addiction?'",
    "'Whatever means necessary,' she replied. \n'No it doesn't,' I said."
  ],
  ["I've started a new band called 'Blanket'.", "We're a cover band."],
  [
    "Did you know that two times ten and two times eleven are actually the same?",
    "two times ten is twenty and two times eleven is twenty too."
  ],
  [
    "My wife woke up just now. She was dreaming and muttering about how she wrote the Lord of The Rings trilogy.",
    "She was Tolkien in her sleep."
  ],
  [
    "I walked into the liquor store and a guy working there asked me, 'Do you need help?'",
    "I said, 'Yes, but I’m here to get whiskey instead.'"
  ],
  [
    "My daughter told me she saw a deer on the way to school.",
    "Me: 'How do you know it was going to school?'"
  ],
  [
    "Interviewer: Your resume says you take things too literally.",
    "Me: 'When the hell did my resume learn to talk?'"
  ],
  [
    "Lance is an uncommon name nowadays. ",
    "But in medieval times people were called lance a lot."
  ],
  [
    "If I’m reading their lips correctly...",
    "My neighbors are arguing about some creepy guy next door."
  ],
  [
    "My wife asked me to put ketchup on the shopping list",
    "Now I can't read anything."
  ],
  [
    "I told my therapist I can't get the Grease soundtrack out of my head...",
    "He said 'tell me more'."
  ],
  [
    "Everytime I see a sign \"Road Work Ahead\" I'm like, \"Yeah... I sure hope it does!\""
  ],
  [
    "The huge spider in my room is now called Cotton Eyed Joe.",
    "Where did he come from, where did he go?"
  ],
  [
    "Cuttlefish = not fish",
    "Starfish = not fish",
    "Jellyfish = not fish",
    "Silverfish = not fish",
    "Shellfish = not fish",
    "",
    "Seahorse = fish"
  ],
  [
    "Who's your favourite character in The Muppet Show?",
    "The Vampire.",
    "He doesn't count.",
    "I can assure you he does."
  ],
  [
    "Fun fact: Ever wondered why it's called the Iliad? Because Ilium was another name for Troy, and the -ad suffix was used to mean 'the story of'.",
    "This means that, if you translated the title, the Iliad should actually be called... ",
    "Troy Story"
  ],
  ["I'm a party animal it's just that the animal in question is a sloth."],
  [
    "I used to think I had a Japanese friend. But he was just my imagine asian."
  ],
  [
    "I opened my birthday card and loads of rice fell out.",
    "I knew right away who sent it, it was my Uncle Ben."
  ],
  ["God creating ants", "Anteater:", "finally"],
  ["Bro, can you pass me that pamphlet?", "Brochure"],
  [
    "i told you this land is off limits",
    "oh i thought you said it was all flimits",
    "wtf are flimits",
    "idk let's go look",
    "ok"
  ],
  [
    "goldfish",
    "hi dog",
    "dog",
    "hi grayfish",
    "hi dog",
    "u said that already",
    "said what"
  ],
  [
    "Luke: should we try to sneak past the sentry?",
    "Yoda: do or do not. there is no try",
    "Luke: should we do or do not to sneak past the sentdo or do not?"
  ],
  [
    "One whiskey and ....... one coke.",
    "Why the big pause?",
    "I don't know, I was born with them"
  ],
  [
    "Whose car is this, where are you taking it and what do you do for a living?",
    "Miner",
    "Mine"
  ],
  ["John Lennon:", "🎶Imagine all the people🎶", "introverts:", "Thank god"],
  [
    "Me: can i play a violin in the street",
    "Cop: no",
    "why not",
    "it’s a traffic violation",
    "this isn't a viola it’s a violin",
    "...",
    "say it"
  ],
  [
    "Come quick, my friend was bitten by a wolf",
    "Operator",
    "Where?",
    "No, a regular one"
  ],
  [
    "hi i'm traci with an i",
    "(clearly sees she has 2 eyes)",
    "you’re not very bright are you Tracy"
  ],
  [
    "i would like to open a checking account",
    "would you like a savings account too?",
    "no",
    "okay, just checking"
  ],
  [
    "[teacher]",
    "what is the past tense of think",
    "[me]",
    "i thought about this"
  ],
  [
    "[teacher]",
    "do you know what estimate means",
    "[me]",
    "not exactly",
    "yes you are right",
    "about what",
    "also correct",
    "...i guess",
    "wow you really know your stuff"
  ],
  ["Hey guess what?", "What?", "Good guess!"],
  ["Do you have any books on turtles?", "Hard back?", "Yes, with little heads"],
  [
    "Oh no! Our neighbour died!",
    "Who, Ray?",
    "I don't think cheering is appropriate, Karen"
  ],
  ["What’s your favourite month?", "July", "Why July?", "I didn't lie"],
  [
    "Steve, you have a problem verbalising your emotions",
    "Can't say I’m surprised"
  ],
  [
    "Genie",
    "What is your final wish?",
    "I wish I were you",
    "Genue",
    "But weurd but alrught."
  ],
  [
    "A man walks into a doctors office",
    "What seems to be the problem?",
    "It’s... um... well... I have five penises",
    "Blimey! how do your trousers fit?",
    "Like a glove."
  ],
  [
    "A naked man arrives at a costume party with a girl on his back.",
    "I'm a turtle",
    "Who’s on your back?",
    "That's Michelle"
  ],
  [
    "My gym trainer was talking about guys lifting up to 400 kilos",
    "That's a lot of cheese",
    "What?"
  ],
  [
    "I don't think you're cut out to be a mime, son.",
    "Was it something I said?",
    "Yes."
  ],
  [
    "Let's put the matter aside for the time being.",
    "(Looking around nervously)",
    "Can only you see the time being?",
    "Huh?",
    "Is it standing near me?",
    "Who?",
    "(On the verge of a panic attack)",
    "The Time Being"
  ],
  [
    "at Dave's, who has like 9 dogs",
    "what do you call a fly with no wings",
    "keith don't",
    "a WALK",
    "drowns in a tidal wave of dogs"
  ],
  [
    "[Mary] They've taken Jesus from his tomb",
    "[Simon] Maybe they gave him Upjesus",
    "[Mary] What's Upjesus",
    "[Jesus (risen)] Not much, w--"
  ],
  [
    "My therapist told me to write letters to everyone who's hurt me then burn them",
    "I did that and I feel great but do I keep the letters?"
  ],
  [
    "I visited my friend at his new house.",
    "He told me to make myself at home",
    "So I threw him out. I hate having visitors."
  ],
  [
    "My wife says that I wasted money ordering a 3-meter wide frame for our wedding photo.",
    "I think she should look at the bigger picture."
  ],
  [
    "\"It's Raining Men\" and \"Let The Bodies Hit The Floor\" are the same song from different points of view.\""
  ],
  [
    "I was in the supermarket the other day when this guy threw a block of Cheddar at me. Outraged I shouted \"Well, that's not very mature, is it?!\""
  ],
  [
    "I hate it when my wife keeps telling me that \"I don't get it.\"",
    "I mean, what does it even mean?"
  ],
  [
    "Melatonin: You want some help falling asleep?",
    "Me: Yes please.",
    "Melatonin: And you want your nightmares more vivid and real?",
    "Me: What? No.",
    "Ceiling lady: YOU HEARD HIM."
  ],
  [
    "We are best friends. Always remember that if you fall, I will pick you up... after I finish laughing."
  ],
  [
    "If you're not happy single, you won't be happy taken. Happiness comes from food, not relationships."
  ],
  [
    "Being kissed in your sleep is the purest form of love.",
    "Unless you're home alone."
  ],
  [
    "The no-smoking with kids in the car law is ridiculous. Just look at them standing outside in the rain."
  ],
  [
    "Walked into a bar and someone yelled \"Does anybody know CPR?\"",
    "I said \"I know the whole alphabet.\"",
    "Everyone laughed, except for that one guy."
  ],
  ["I can't stand sitting down."],
  ["My grandfather invented the cold air balloon. It never really took off."],
  [
    "A cannibal once took my girlfriend out to see a Russell Crowe film.",
    "Gladiator?",
    "No, I really miss her."
  ],
  ["A midwife helps people out."],
  [
    "The most amazing display of cooperation is when 1000 islands came together and agreed on a single dressing."
  ],
  [
    "I'm addicted to buying old Beatles records.",
    "Sounds you need help?",
    "No I already have that one."
  ],
  [
    "I bet when cheetahs race and one of them cheats, the other one goes \"Man, you're such a cheetah!\" and they laugh and eat a zebra or whatever."
  ]
]
